Revit 2027 API
KeyBasedTreeEntryError.GetEntry Method
 Gets the entry for which an error occurred while building the KeyBasedTreeEntries object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public KeyBasedTreeEntry GetEntry()
Public Function GetEntry As KeyBasedTreeEntry
public:
KeyBasedTreeEntry^ GetEntry()
member GetEntry : unit -> KeyBasedTreeEntry
Return Value
KeyBasedTreeEntry
 A copy of the KeyBasedTreeEntry.
See Also
Reference
KeyBasedTreeEntryError Class
Autodesk.Revit.DB Namespace